In [2]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 28, 35],
        'Score': [85, 92, 70, 90]}
df = pd.DataFrame(data)

df.index=['n1','n2','n3','n4']

In [3]:
df.index

Index(['n1', 'n2', 'n3', 'n4'], dtype='object')

Selecting one row using loc and iloc

In [4]:
df.loc['n1']

Name     Alice
Age         25
Score       85
Name: n1, dtype: object

In [5]:
df.iloc[0]

Name     Alice
Age         25
Score       85
Name: n1, dtype: object

Selecting one column using loc and iloc

In [6]:
df.loc[:,'Name']

n1      Alice
n2        Bob
n3    Charlie
n4      David
Name: Name, dtype: object

In [7]:
df.iloc[:,0]

n1      Alice
n2        Bob
n3    Charlie
n4      David
Name: Name, dtype: object

Selecting multiple rows

In [8]:
df.loc[['n1','n2']]

     Name  Age  Score
n1  Alice   25     85
n2    Bob   30     92

In [9]:
df.iloc[[0,1]]

     Name  Age  Score
n1  Alice   25     85
n2    Bob   30     92

Selecting multiple columns

In [26]:
df.loc[:,['Name','Score']]

       Name  Score
n1     John     85
n2      Bob     92
n3  Charlie     70
n4    David     90

In [11]:
df.iloc[:,[0,2]]

       Name  Score
n1    Alice     85
n2      Bob     92
n3  Charlie     70
n4    David     90

Select row range

In [18]:
df.loc['n1':'n3']

       Name  Age  Score
n1    Alice   25     85
n2      Bob   30     92
n3  Charlie   28     70

In [20]:
df.iloc[0:3]

       Name  Age  Score
n1    Alice   25     85
n2      Bob   30     92
n3  Charlie   28     70

Select  column range

In [21]:
df.loc[:,'Name':'Score']

       Name  Age  Score
n1    Alice   25     85
n2      Bob   30     92
n3  Charlie   28     70
n4    David   35     90

In [22]:
df.iloc[:,0:3]

       Name  Age  Score
n1    Alice   25     85
n2      Bob   30     92
n3  Charlie   28     70
n4    David   35     90

Update value in dataframe

In [24]:
df.loc['n1','Name']='John'
print(df)

       Name  Age  Score
n1     John   25     85
n2      Bob   30     92
n3  Charlie   28     70
n4    David   35     90

In [25]:
df.iloc[0,0]='John'
print(df)

       Name  Age  Score
n1     John   25     85
n2      Bob   30     92
n3  Charlie   28     70
n4    David   35     90

In [ ]:
df.loc[row_label, column_label]